{
  "architectures": [
    "SentimentClassifier"
  ],
  "dropout": 0.1,
  "dtype": "float32",
  "freeze_backbone": false,
  "head": "mlp",
  "hidden_size": 768,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1",
    "2": "LABEL_2"
  },
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1,
    "LABEL_2": 2
  },
  "model_name": "bert-base-uncased",
  "model_type": "sentiment_classifier",
  "pooling_strategy": "cls",
  "transformers_version": "4.57.1"
}
